---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsConduitDiameterParam
source: html/73e4424f-62d5-9a03-d400-5d5b525f0b8b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsConduitDiameterParam Property

"Diameter(Trade Size)"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsConduitDiameterParam { get; }
```